{
    "file": "wire\/modules\/Fieldtype\/FieldtypeURL.module",
    "textdomain": "wire--modules--fieldtype--fieldtypeurl-module",
    "translations": {
        "93cba07454f06a4a960172bbd6e2a435": {
            "text": "Sim"
        },
        "bafd7322c6e97d25b6299b5d6fe8920b": {
            "text": "Não"
        },
        "b38bb5008cd8427aae4e9a8612183a6f": {
            "text": "formatador de texto \"HTML Entity Encoder\" é recomendado para campos de URL."
        },
        "7a51839f06248c613d3b07007f4fc05d": {
            "text": "Se este URL for usado para qualquer saída, é altamente recomendável que você selecione o \"Codificador de entidade HTML\" para \"Formatadores de texto\" na guia Detalhes."
        },
        "ab86e8efb5aa46bdab329fa44f7125fc": {
            "text": "Permitir URLs relativos\/locais sem \"http:\/\/\" no início?"
        },
        "d1280d091f34a15c77f4145110d7f94d": {
            "text": "URLs locais\/relativas são aquelas sem esquema e domínio."
        },
        "00b2e08d975238a3563e783aa19811fd": {
            "text": "Permitir nomes de domínio internacionalizados (IDNs)?"
        },
        "05e7ec04e65f559e191ad8a7c4a02b03": {
            "text": "Quando ativado, nomes de domínio não ASCII são permitidos."
        },
        "e8e4b5ed6eb1c0a268c7587be6ca66e7": {
            "text": "Permitir caracteres de aspas simples\/duplas em URLs?"
        },
        "1b6f57a9eab52d70bc2fff5321da54fb": {
            "text": "Quando ativado, você deve ter certeza absoluta de que tais URLs são codificados por entidade quando usados na marcação."
        },
        "c4c54678f0d612f89caacaab99768f81": {
            "text": "Acrescentar o caminho raiz do site a URLs locais\/relativos?"
        },
        "9d6ce819c098e5c4a7b3464cadbd028a": {
            "text": "Esta opção irá automaticamente preparar o caminho raiz do site para quaisquer URLs que comecem com uma barra, como \/algum\/caminho\/. Isso é útil se seu site estiver rodando de um subdiretório, pois você não precisará incluir esse subdiretório nas URLs inseridas neste campo. Se posteriormente você mover seu site para a raiz de um domínio (ou outro subdiretório), você não precisará se preocupar com URLs quebradas. Com esta opção ativada, sempre insira URLs como se o site estivesse rodando da raiz do domínio, independentemente de estar rodando de um subdiretório ou não. Naturalmente, isso só é aplicável se você selecionou 'Sim' para permitir URLs locais\/relativas no campo acima. Desenvolvedores também podem querer observar que esta opção se aplica apenas quando a formatação de saída da página está ativada."
        },
        "ae91f58b191e424e0eaf9022fd5407e9": {
            "text": "Garante que URLs não quebrem ao mover um site de um subdiretório para a raiz (o exemplo mais comum)."
        },
        "0ac82d10c1ddd050079962481c40f54f": {
            "text": "Campo que armazena uma URL"
        }
    }
}